body.xml

<?xml version="1.0" encoding="utf-8"?>
      <soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
          <getValoresSeriesXML
            xmlns="https://www3.bcb.gov.br/wssgs/services/FachadaWSSGS">
            
              
                <codigosSeries><item>12</item></codigosSeries>
              
            
              
                <dataInicio>01/01/2018</dataInicio>
              
            
              
                <dataFim>01/02/2018</dataFim>
              
            
          </getValoresSeriesXML>
        </soapenv:Body>
      </soapenv:Envelope>